# Домашнее задание 1.
# Создайте словарь "car" с ключами "марка", "модель" и "год". Присвойте значения соответствующим ключам.
# Добавьте в словарь "car" новый ключ-значение "цвет" со значением "черный".
# Выведите значение ключа "марка" из словаря "car".
# Создайте список "fruits" и добавьте в него названия нескольких фруктов.
# Выведите на экран первый элемент из списка "fruits".
# Создайте кортеж "numbers" и запишите в него несколько чисел.
# Выведите на экран последний элемент из кортежа "numbers".
car={'марка':'ВАЗ','модель':'2101','год':1989}
car['цвет']='черный'
print(car['марка'])
fruits=['яблоко','груша','апельсин']
print(fruits[0])
numbers=(2,4,8,16)
print(numbers[-1])